Strogino/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>InformationRegister.ОтправкаСМС</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКСборке</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Собран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоставки</name>
    <type>
      <types>EnumRef.ТипДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестПростых</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестХолодных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоСМС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПробития</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПробития</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.ТипОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыОбработкиЗаказа</name>
    <type>
      <types>CatalogRef.СтатусыОбработкиЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСамовывоза</name>
    <type>
      <types>CatalogRef.ТочкиСамовывоза</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомплектацииЗаказа</name>
    <type>
      <types>EnumRef.ТипКомплектацииЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВставленИзНехватило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПриОформлении</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/InformationRegisters/ОтправкаСМС/ОтправкаСМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправкаСМС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>АдресХранения</name>
    <type>
      <types>CatalogRef.АдресХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>created</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sms</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>approved</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_t_tc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>iddoc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Strogino/src/Enums/ТипКомплектацииЗаказа/ТипКомплектацииЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипКомплектацииЗаказа</name>
  <enumValues>
    <name>СборкаИКомплектацияВАптеке</name>
  </enumValues>
  <enumValues>
    <name>СборкаНаСкладеВКоробку_КомплектацияВАптеке</name>
  </enumValues>
  <enumValues>
    <name>СборкаНаСкладеВПакеты_РаскладкаПакетовВАптеке</name>
  </enumValues>
</mdclass:Enum>

Strogino/src/Enums/ТипСборки/ТипСборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипСборки</name>
  <enumValues>
    <name>СборкаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>СборкаПеремещения</name>
  </enumValues>
  <enumValues>
    <name>СборкаЗаказовИзКоробки</name>
  </enumValues>
  <enumValues>
    <name>СнятиеРезерваПоОтмененнымЗаказам</name>
  </enumValues>
  <enumValues>
    <name>ОчисткаЯчеекОтТоваровПоОтмененнымЗаказам</name>
  </enumValues>
</mdclass:Enum>

Strogino/src/Documents/Заказ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ТипКомплектацииЗаказа = Перечисления.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке
		или ТипКомплектацииЗаказа = Перечисления.ТипКомплектацииЗаказа.СборкаНаСкладеВКоробку_КомплектацияВАптеке тогда
		
		Если ТипКомплектацииЗаказа = Перечисления.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке тогда
			Движения.ОстаткиТовара.Записывать = Истина;
			Движения.ОстаткиТовара.Очистить();
		КонецЕсли;
		
		Движения.ТоварыКСборке.Записывать = Истина;
		Движения.ТоварыКСборке.Очистить();	

		Для каждого строка из Товар цикл
			КоличествоСписываемое = ?(Строка.КоличествоПриОформлении = 0, строка.Количество, Строка.КоличествоПриОформлении);
			
			Если ТипКомплектацииЗаказа = Перечисления.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке тогда		
				Движение = Движения.ОстаткиТовара.ДобавитьРасход();
				Движение.Отдел = Отдел;
				Движение.Период = Дата;
				Движение.Товар = Строка.Товар;
				Движение.Партия = Строка.Партия;
				Движение.Остаток = КоличествоСписываемое;
				
				Движение = Движения.ОстаткиТовара.ДобавитьПриход();
				Движение.Отдел = Отдел;
				Движение.Период = Дата;
				Движение.Товар = Строка.Товар;
				Движение.Партия = Строка.Партия;
				Движение.ДокументРезерва = Ссылка;
				Движение.Резерв = КоличествоСписываемое;						
				
			КонецЕсли;
			
			Если не Строка.Товар.ВиртуальныйТовар тогда
				Движение = Движения.ТоварыКСборке.ДобавитьПриход();
				Движение.Документ = Ссылка;
				Движение.Склад = Отдел;
				Движение.Период = Дата;
				Движение.Товар = Строка.Товар;
				Если ТипКомплектацииЗаказа = Перечисления.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке тогда
					Движение.ТипСборки = перечисления.ТипСборки.СборкаЗаказовИзКоробки;
				Иначе
					Движение.Партия = Строка.Партия;
					Движение.ТипСборки = перечисления.ТипСборки.СборкаЗаказа;
				КонецЕсли;
				Движение.КоличествоКСборке = КоличествоСписываемое;
				Движение.КоличествоНаКомплектации = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	Движения.ОтправкаСМС.Прочитать();

	Если СтатусыДокументов.ПолучитьСтатусСборкиЗаказа(Ссылка) = Справочники.СтатусыОбработкиЗаказа.ЗаказВТочкеСамовывоза
		И Движения.ОтправкаСМС.Количество() = 0	И СтатусыДокументов.ПолучитьСтатусАктуальностиЗаказа(Ссылка) тогда
		Движения.ОтправкаСМС.Записывать = Истина;
		ТелефонПер = СокрЛП(Лев(Телефон,10));
		Если СтрДлина(ТелефонПер) < 10 тогда
			Возврат;
		КонецЕсли;
		Если Лев(ТелефонПер,3) = "495" или Лев(ТелефонПер,3) = "499"
			или Лев(ТелефонПер,3) = "496" или Лев(ТелефонПер,3) = "812" тогда
			Возврат;
		КонецЕсли;
		Движение = Движения.ОтправкаСМС.Добавить();
		Движение.Период = ТекущаяДата();
		Движение.created = ПараметрыСеанса.ТекущийПользователь.Наименование;
		Движение.phone = ТелефонПер;
		//---%%% Тарасков - 12.09.2017 - Начало
		//Движение.sms = СокрЛП("Заказ №"+СокрЛП(Номер)+" ожидает в аптеке EAPTEKA "+СокрЛП(ТочкаСамовывоза.АдресХранения.Адрес))+". Сумма "+Формат(Товар.Итог("Всего"),"ЧДЦ=2")+" р.";
		Движение.sms = СокрЛП("Заказ №"+СокрЛП(Номер)+" ожидает в аптеке EAPTEKA "+СокрЛП(ТочкаСамовывоза.АдресХранения.Адрес)) + ", Пн-Вс 8-23. Сумма " + Формат( Товар.Итог( "Всего" ) - 0.5, "ЧДЦ=" ) + " р.";
		//---%%% Тарасков - 12.09.2017 - Конец
		Движение.approved = "auto";
		Движение.id_t_tc = СокрЛП(Строка(ТипЦены.Код));
		Движение.iddoc = ID_77;
		Движение.type = 1;
		Движение.АдресХранения = ТочкаСамовывоза.АдресХранения;
	КонецЕсли;
	//Если ДополнительныеСвойства.Свойство("ПометитьНаОбмен") тогда
	//	НЗ = РегистрыСведений.ЗаказыСИзменившемсяСатусом.СоздатьНаборЗаписей();	
	//	НЗ.Отбор.Заказ.Значение = Ссылка;
	//	НЗ.Отбор.Заказ.Использование = Истина;
	//	Запись = НЗ.Добавить();
	//	Запись.Заказ = Ссылка;
	//	НЗ.Записать(Истина);
	//КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента =  Товар.Итог("Всего");
	
КонецПроцедуры
